MorgothCreator/CppSDK/SDK/platform/stm32f4/interface/screen.cpp
#if !defined(USE_STM32469I_DISCO_REVA)
	dsiPllInit.PLLNDIV = 125;
	dsiPllInit.PLLIDF = DSI_PLL_IN_DIV2;
	dsiPllInit.PLLODF = DSI_PLL_OUT_DIV1;
#else
	dsiPllInit.PLLNDIV = 100;
	dsiPllInit.PLLIDF = DSI_PLL_IN_DIV5;
	dsiPllInit.PLLODF = DSI_PLL_OUT_DIV1;
#endif
	laneByteClk_kHz = 62500; /* 500 MHz / 8 = 62.5 MHz = 62500 kHz */

	/* Set number of Lanes */
	hdsi_eval.Init.NumberOfLanes = DSI_TWO_DATA_LANES;

	/* TXEscapeCkdiv = f(LaneByteClk)/15.62 = 4 */
	hdsi_eval.Init.TXEscapeCkdiv = laneByteClk_kHz / 15620;

	HAL_DSI_Init(&(hdsi_eval), &(dsiPllInit));
	Clockratio = laneByteClk_kHz / LcdClock;
	/* Timing parameters for all Video modes
	 * Set Timing parameters of LTDC depending on its chosen orientation
	 */
	VSA = pDisplay->LcdTimings->vsw; /* 12 */
	VBP = pDisplay->LcdTimings->vbp; /* 12 */
	VFP = pDisplay->LcdTimings->vfp; /* 12 */
	HSA = pDisplay->LcdTimings->hsw; /* 120 */
	HBP = pDisplay->LcdTimings->hbp; /* 120 */
	HFP = pDisplay->LcdTimings->hfp; /* 120 */
	HACT = pDisplay->LcdTimings->X;
	VACT = pDisplay->LcdTimings->Y;

	hdsivideo_handle.VirtualChannelID = LCD_OTM8009A_ID;
	hdsivideo_handle.ColorCoding = LCD_DSI_PIXEL_DATA_FMT_RBG888;
	hdsivideo_handle.VSPolarity = DSI_VSYNC_ACTIVE_HIGH;
	hdsivideo_handle.HSPolarity = DSI_HSYNC_ACTIVE_HIGH;
	hdsivideo_handle.DEPolarity = DSI_DATA_ENABLE_ACTIVE_HIGH;
	hdsivideo_handle.Mode = DSI_VID_MODE_BURST; /* Mode Video burst ie : one LgP per line */
	hdsivideo_handle.NullPacketSize = 0xFFF;
	hdsivideo_handle.NumberOfChunks = 0;
	hdsivideo_handle.PacketSize = HACT; /* Value depending on display orientation choice portrait/landscape */
	hdsivideo_handle.HorizontalSyncActive = HSA * Clockratio;
	hdsivideo_handle.HorizontalBackPorch = HBP * Clockratio;
	hdsivideo_handle.HorizontalLine = (HACT + HSA + HBP + HFP) * Clockratio; /* Value depending on display orientation choice portrait/landscape */
	hdsivideo_handle.VerticalSyncActive = VSA;
	hdsivideo_handle.VerticalBackPorch = VBP;
	hdsivideo_handle.VerticalFrontPorch = VFP;
	hdsivideo_handle.VerticalActive = VACT; /* Value depending on display orientation choice portrait/landscape */

	/* Enable or disable sending LP command while streaming is active in video mode */
	hdsivideo_handle.LPCommandEnable = DSI_LP_COMMAND_ENABLE; /* Enable sending commands in mode LP (Low Power) */

	/* Largest packet size possible to transmit in LP mode in VSA, VBP, VFP regions */
	/* Only useful when sending LP packets is allowed while streaming is active in video mode */
	hdsivideo_handle.LPLargestPacketSize = 64;

	/* Largest packet size possible to transmit in LP mode in HFP region during VACT period */
	/* Only useful when sending LP packets is allowed while streaming is active in video mode */
	hdsivideo_handle.LPVACTLargestPacketSize = 64;

	/* Specify for each region of the video frame, if the transmission of command in LP mode is allowed in this region */
	/* while streaming is active in video mode                                                                         */
	hdsivideo_handle.LPHorizontalFrontPorchEnable = DSI_LP_HFP_ENABLE; /* Allow sending LP commands during HFP period */
	hdsivideo_handle.LPHorizontalBackPorchEnable = DSI_LP_HBP_ENABLE; /* Allow sending LP commands during HBP period */
	hdsivideo_handle.LPVerticalActiveEnable = DSI_LP_VACT_ENABLE; /* Allow sending LP commands during VACT period */
	hdsivideo_handle.LPVerticalFrontPorchEnable = DSI_LP_VFP_ENABLE; /* Allow sending LP commands during VFP period */
	hdsivideo_handle.LPVerticalBackPorchEnable = DSI_LP_VBP_ENABLE; /* Allow sending LP commands during VBP period */
	hdsivideo_handle.LPVerticalSyncActiveEnable = DSI_LP_VSYNC_ENABLE; /* Allow sending LP commands during VSync = VSA period */

	/* Configure DSI Video mode timings with settings set above */
	HAL_DSI_ConfigVideoMode(&(hdsi_eval), &(hdsivideo_handle));

	/* Enable the DSI host and wrapper : but LTDC is not started yet at this stage */
	HAL_DSI_Start(&(hdsi_eval));
	/*************************End DSI Initialization*******************************/

	/************************LTDC Initialization***********************************/

	/* Timing Configuration */
	LtdcHandler.Init.HorizontalSync = (HSA - 1);
	LtdcHandler.Init.AccumulatedHBP = (HSA + HBP - 1);
	LtdcHandler.Init.AccumulatedActiveW = (pDisplay->LcdTimings->X + HSA + HBP
			- 1);
	LtdcHandler.Init.TotalWidth =
			(pDisplay->LcdTimings->X + HSA + HBP + HFP - 1);

	/* Initialize the LCD pixel width and pixel height */
	LtdcHandler.LayerCfg->ImageWidth = pDisplay->LcdTimings->X;
	LtdcHandler.LayerCfg->ImageHeight = pDisplay->LcdTimings->Y;

	/* Background value */
	LtdcHandler.Init.Backcolor.Blue = 0;
	LtdcHandler.Init.Backcolor.Green = 0;
	LtdcHandler.Init.Backcolor.Red = 0;
	LtdcHandler.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
	LtdcHandler.Instance = LTDC;

	/* Get LTDC Configuration from DSI Configuration */
	HAL_LTDC_StructInitFromVideoConfig(&(LtdcHandler), &(hdsivideo_handle));

	/* Initialize the LTDC */
	HAL_LTDC_Init(&LtdcHandler);

	/* Initialize the font */
	DMA2D_Config();
	BSP_LCD_LayerDefaultInit(_pDisplay, 0, LCD_FB_START_ADDRESS);
	//BSP_LCD_SetFont(&LCD_DEFAULT_FONT);

	/************************End LTDC Initialization*******************************/

	/***********************OTM8009A Initialization********************************/

	/* Initialize the OTM8009A LCD Display IC Driver (KoD LCD IC Driver)
	 *  depending on configuration set in 'hdsivideo_handle'.
	 */
	OTM8009A_Init(_pDisplay, hdsivideo_handle.ColorCoding);

	/***********************End OTM8009A Initialization****************************/
	pDisplay->sClipRegion.sXMax = pDisplay->LcdTimings->X;
	pDisplay->sClipRegion.sYMax = pDisplay->LcdTimings->Y;
	return LCD_OK;
}
#endif
/**
 * @brief  Fills a buffer.
 * @param  LayerIndex: Layer index
 * @param  pDst: Pointer to destination buffer
 * @param  xSize: Buffer width
 * @param  ySize: Buffer height
 * @param  OffLine: Offset
 * @param  ColorIndex: Color index
 */
static void LL_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize,
		uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex)
{
	/*##-1- Configure the DMA2D Mode, Color Mode and output offset #############*/
	Dma2dHandle.Init.Mode = DMA2D_R2M;
	Dma2dHandle.Init.ColorMode = DMA2D_ARGB8888;
	Dma2dHandle.Init.OutputOffset = OffLine;

