MorgothCreator/CppSDK/SDK/platform/stm32f4/interface/screen.cpp
	/* DMA2D Initialization */
	if (HAL_DMA2D_Init(&Dma2dHandle) == HAL_OK)
	{
		if (HAL_DMA2D_ConfigLayer(&Dma2dHandle, LayerIndex) == HAL_OK)
		{
			if (HAL_DMA2D_Start(&Dma2dHandle, ColorIndex | 0xFF000000,
					(uint32_t) pDst, xSize, ySize) == HAL_OK)
			{
				/* Polling For DMA transfer */
				HAL_DMA2D_PollForTransfer(&Dma2dHandle, 100);
			}
		}
	}
}

#endif

#if defined(STM32F469xx) || defined(STM32F479xx)

void GI::Dev::IntScreen::init(LCD_TIMINGS *timings, GI::Dev::Gpio* backlight)
{
	this->backlight = backlight;
	LcdTimings = timings;
	//screen_open(LcdStruct);
	if (BSP_LCD_InitEx((void *) this) == LCD_OK)
	{
		clear(0xFFFF0F0F);
		err = SYS_ERR_OK;
	}
	else
	{
		err = SYS_ERR_INIT;
	}
#ifdef SSD2119
	STM32f4_Discovery_LCD_Init();
#endif
}

void GI::Dev::IntScreen::deinit()
{

}
/**********************************************/
void GI::Dev::Screen::setOn()
{
	err = SYS_ERR_NOT_IMPLEMENTED;
	/* Send Display on DCS command to display */
	/*HAL_DSI_ShortWrite(&(hdsi_eval),
	 hdsivideo_handle.VirtualChannelID,
	 DSI_DCS_SHORT_PKT_WRITE_P1,
	 OTM8009A_CMD_DISPON,
	 0x00);*/
}
/**********************************************/
void GI::Dev::Screen::setOff()
{
	err = SYS_ERR_NOT_IMPLEMENTED;
	/* Send Display off DCS Command to display */
	/*HAL_DSI_ShortWrite(&(hdsi_eval),
	 hdsivideo_handle.VirtualChannelID,
	 DSI_DCS_SHORT_PKT_WRITE_P1,
	 OTM8009A_CMD_DISPOFF,
	 0x00);*/
}
//#######################################################################################
int GI::Dev::Screen::setBacklight(unsigned char value)
{
	err = SYS_ERR_OK;
	if (backlight)
	{
		if (value)
			backlight->setOut(1);
		else
			backlight->setOut(0);
		return SYS_ERR_OK;
	}
	err = SYS_ERR_NOT_INITIALIZED;
	return SYS_ERR_NOT_INITIALIZED;
}
//#######################################################################################
bool GI::Dev::Screen::copyScreen(void *_pDisplayFrom, bool put_cursor,
		signed int X, signed int Y, unsigned int color)
{
	GI::Dev::Screen *pDisplayTo = this;
	GI::Dev::Screen *pDisplayFrom = (GI::Dev::Screen *) _pDisplayFrom;
	if (pDisplayTo->LcdTimings->X != pDisplayFrom->LcdTimings->X
			|| pDisplayTo->LcdTimings->Y != pDisplayFrom->LcdTimings->Y)
		return false;
	CacheDataCleanBuff((unsigned int) pDisplayFrom->DisplayData,
			(pDisplayFrom->LcdTimings->X * pDisplayFrom->LcdTimings->Y
					* sizeof(pDisplayFrom->DisplayData[0]))
					+ (pDisplayFrom->LcdTimings->palete_len
							* sizeof(pDisplayFrom->DisplayData[0])));
	signed int LineCnt = 0;
	volatile unsigned int* ScreenBuff = pDisplayTo->DisplayData
			+ pDisplayTo->LcdTimings->palete_len;
	volatile unsigned int* _ScreenBuff = pDisplayFrom->DisplayData
			+ pDisplayTo->LcdTimings->palete_len;

	for (; LineCnt < pDisplayTo->LcdTimings->Y; LineCnt++)
	{
		memcpy((void *) (ScreenBuff + (pDisplayFrom->LcdTimings->X * LineCnt)),
				(void *) (_ScreenBuff + (pDisplayFrom->LcdTimings->X * LineCnt)),
				(sizeof(ScreenBuff[0]) * pDisplayTo->LcdTimings->X));
		if (put_cursor == true && LineCnt >= Y && LineCnt <= Y + 2)
		{
			signed int cnt_x = X;
			for (; cnt_x < X + 2; cnt_x++)
				drawPixel(cnt_x, LineCnt, color);
		}
	}
	return true;
}
//#######################################################################################
void GI::Dev::Screen::cacheClean(signed int x_start, signed int y_start,
		signed int x_len, signed int y_len)
{
	//tDisplay *pDisplay = (tDisplay *)_pDisplay;

}
//#######################################################################################
void GI::Dev::Screen::drawRectangle(signed int x_start, signed int y_start,
		signed int x_len, signed int y_len, bool fill, unsigned int color)
{
	signed int x_end = x_start + x_len, y_end = y_start + y_len;
	if (x_start >= sClipRegion.sXMax || y_start >= sClipRegion.sYMax
			|| x_end < sClipRegion.sXMin || y_end < sClipRegion.sYMin)
		return;
	register signed int LineCnt = y_start;
	//volatile unsigned int* ScreenBuff = (volatile unsigned int *)LCD_FB_START_ADDRESS;
	unsigned int _color = color | 0xFF000000;
	if (fill)
	{
		if (LineCnt < sClipRegion.sYMin)
			LineCnt = sClipRegion.sYMin;
		signed int _x_start = x_start;
		if (_x_start < sClipRegion.sXMin)
			_x_start = sClipRegion.sXMin;
		register signed int _x_end = x_end;
		if (_x_end > sClipRegion.sXMax)
			_x_end = sClipRegion.sXMax;
		register signed int _y_end = y_end;
		if (_y_end > sClipRegion.sYMax)
			_y_end = sClipRegion.sYMax;
		uint32_t Xaddress = 0;
		Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress)
				+ 4 * (LcdTimings->X * LineCnt + _x_start);
		/* Fill the rectangle */
		LL_FillBuffer(0, (uint32_t *) Xaddress, _x_end - _x_start,
				_y_end - LineCnt, LcdTimings->X - (_x_end - _x_start), _color);
		return;
	}

	drawHLine(x_start, x_len - 1, y_start, 1, color);
	drawHLine(x_start, x_len, (y_start + y_len) - 1, 1, color);
	drawVLine(y_start, y_len - 1, x_start, 1, color);
	drawVLine(y_start, x_len, (x_start + x_len) - 1, 1, color);
	return;
}
//#######################################################################################
void GI::Dev::Screen::drawPixel(signed int X, signed int Y, unsigned int color)
{
	if (X >= sClipRegion.sXMin && Y >= sClipRegion.sYMin
			&& X < sClipRegion.sXMax && Y < sClipRegion.sYMax)
	{
		uint32_t Xaddress = 0;
		Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress)
				+ 4 * (LcdTimings->X * Y + X);
		/* Fill the rectangle */
		LL_FillBuffer(0, (uint32_t *) Xaddress, 1, 1, LcdTimings->X - 1,
				color | 0xFF000000);
	}
}
//#######################################################################################
void GI::Dev::Screen::copyRectangle16Bit(unsigned short *rgb_buffer,
		unsigned int x1, unsigned int y1, unsigned int width,
		unsigned int height)
{
	//tDisplay *pDisplay = (tDisplay *)_pDisplay;
}
//#######################################################################################
void GI::Dev::Screen::copyRectangle24Bit(unsigned char *rgb_buffer,
		unsigned long x1, unsigned long y1, unsigned long width,
		unsigned long height)
{
	//tDisplay *pDisplay = (tDisplay *)_pDisplay;
}
//#######################################################################################
void GI::Dev::Screen::copyRectangle32Bit(unsigned char *rgb_buffer,
		unsigned int x1, unsigned int y1, unsigned int width,
		unsigned int height)
{

	/*//tWindow *ParentWindow = (tWindow*)settings->Internals.ParentWindow;
	 //tDisplay *pDisplay = settings->Internals.pDisplay;
	 //tRectangle back_up_clip = sClipRegion;
	 //sClipRegion = settings->Internals.PictureWindowLimits;
	 ////put_pixel(pDisplay, X + settings->Position.X + 2, Y + settings->Position.Y + 2, color);
	 tRectangle rectangle;
	 rectangle.sXMin = 0;
	 rectangle.sXMax = width;
	 rectangle.sYMin = 0;
	 rectangle.sYMax = height;
	 tRectangle *dest_rectangle = &rectangle;
	 tRectangle *src_rectangle = &rectangle;

	 signed int dest_X_StartBox = x1;
	 signed int dest_Y_StartBox = y1;
	 //signed int dest_X_EndBox = settings->Internals.Position.X + settings->Internals.Size.X;
	 //signed int dest_Y_EndBox = settings->Internals.Position.Y + settings->Internals.Size.Y;

